In [24]:
import pandas as pd
house=pd.read_csv(r"C:\Users\Lenovo\OneDrive\Desktop\research\HOUSING CSV FILE.csv")

In [ ]:
1. How many houses are having waterfront?
a. 140
b. 340
c. 323
d. 163

# Ans:d. 163

In [2]:
house['waterfront'].value_counts().to_frame()

   waterfront
0       21450
1         163

In [ ]:
2. Which zip code is having the costliest house?
a. 98456
b. 98102
c. 98283
d. 89034

#Ans: b. 98102

In [138]:
house.nlargest(1,['price'], keep='first')

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,grade_up
7252,6762700020,20141013T000000,7700000,6,8.0,12050,27600,2.5,0,3,...,8570,3480,1910,1987,98102,47.6298,-122.323,3940,8800,15

In [ ]:
3. How many houses are having grade 10?
a. 1133
b. 1134
c. 1135
d. 1132

#Ans: b. 1134

In [27]:
house['grade'].value_counts()

7     8981
8     6068
9     2615
6     2038
10    1134
11     399
5      242
12      90
4       29
13      13
3        3
1        1
Name: grade, dtype: int64

In [29]:
house.loc[(house['grade']==10),'id':'grade'].shape

(1134, 12)

In [ ]:
4. How many null values are there in the dataset?
a. 20
b. 19
c. 0
d. 4

#Ans:c. 0

In [ ]:
house.isnull().sum()

In [ ]:
5. Does this 9126100861 customer have a waterfront?
a. Yes
b. No

#Ans: b. No

In [8]:
house.loc[house['id']==9126100861,['waterfront']]

     waterfront
400           0

In [ ]:
6. How many houses are having 3 views?
a. 340
b. 550
c. 510
d. 90

#Ans: c. 510

In [17]:
house.loc[(house['view']==3),['id']]

               id
15     9297300055
60     1516000055
114    8961960160
153    7855801670
216      46100204
...           ...
21327  7394400080
21344  8835770170
21505  9468200109
21539  8902000201
21540   715010530

[510 rows x 1 columns]

In [ ]:
7. What is the lowest price of the house?
a. 45000
b. 28000
c. 75000
d. 25000

#Ans: c. 75000

In [18]:
house['price'].min()

75000

In [ ]:
8. Which zip code area is having the cheapest house?
a. 98000
b. 98022
c. 80000
d. 94500

#Ans:98022

In [144]:
house.nsmallest(1,['price'], keep='first')

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,grade_up
1149,3421079032,20150217T000000,75000,1,0.0,670,43377,1.0,0,0,...,670,0,1966,0,98022,47.2638,-121.906,1160,42882,5

In [ ]:
9. Which area is having the biggest sqft_living?
a. 98053
b. 98055
c. 98035
d. None of the above

#Ans: a. 98053

In [153]:
house.nlargest(1,['sqft_living','zipcode'], keep='first')

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,grade_up
12777,1225069038,20140505T000000,2280000,7,8.0,13540,307752,3.0,0,4,...,9410,4130,1999,0,98053,47.6675,-121.986,4850,217800,14

In [ ]:
10. In which year the costliest house has been built?
a. 2000
b. 1992
c. 1911
d. 1910

# Ans: d. 1910

In [19]:
house = house [['yr_built','price']][house.price==house['price'].max()]
house

      yr_built    price
7252      1910  7700000

In [ ]:
11. Which of the following data types can a Pandas Series have?
a. Int
b. Str
c. Float
d. All of the above

#Ans: d. All of the above

In [ ]:
df = pd.DataFrame({'A':[41, 23, 56], 'B':[1, '2021-01-01', 34.34], 'C':[1.3, 3.23, 267.3]})

print("DataFrame:")
print(df)


# apply the dtype attribute
result = df.dtypes

print("Output:")
print(result)

In [ ]:
12. Which of the following is having a one-dimensional array?
a. Series data type
b. DataFrame data type
c. Both of the above
d. None of the above


#Ans:  a. Series data type

In [ ]:
13. What value you will get on the left side after printing a series format data?
a. Data
b. Value
c. Index
d. All of the above

#Ans: c. Index

In [ ]:
series1 = pd.Series([10,20,30])

print(series1)

In [ ]:
14. Which of the following is considered as data in pandas?
a. Dictionary
b. Boolean
c. Nd-array
d. All of the above

#Ans: d. All of the above

In [ ]:
15. In what format the keys will get converted into when we convert the dictionary data into
data frame format?
a. Rows
b. Columns
c. Indexes
d. Records

# Ans: b. Columns

In [ ]:
details = {'Name': ['Nick', 'David', 'Joe', 'John'],
        'Age': ['5', '10', '7', '36']} 
new = pd.DataFrame.from_dict(details)  
new

In [ ]:
16. Write a function to perform the following operation:
Increase the grade of the house by 1 if the sqft of the house is greater than 0 and less than
equal to 400. If the total sqft of the house is greater than 400, increase the grade of the house
by 2.
After creating the above function, which syntax will be using when using apply function to run
the above created function in the dataset?
a. data.apply(your_function_name(arg1))
b. data.apply_fun(function_name())
c. data.app(data)
d. None of the above

# Ans: a. data.apply(your_function_name(arg1))

In [110]:
house.loc[:,['sqft_living','grade']]

       sqft_living  grade
0             1180      7
1             2570      7
2              770      6
3             1960      7
4             1680      8
...            ...    ...
21608         1530      8
21609         2310      8
21610         1020      7
21611         1600      8
21612         1020      7

[21613 rows x 2 columns]

In [122]:
def add_grade(row):
    sqft_living=row[0]
    grade=row[1]
    if sqft_living > 0 and sqft_living <= 400:
        return grade + 1
    else:
        return grade + 2
    return grade

In [128]:
house['grade_up']=house.loc[:,['sqft_living','grade']].apply(add_grade, axis=1)

In [132]:
house.loc[:,['sqft_living','grade','grade_up']]

       sqft_living  grade  grade_up
0             1180      7         9
1             2570      7         9
2              770      6         8
3             1960      7         9
4             1680      8        10
...            ...    ...       ...
21608         1530      8        10
21609         2310      8        10
21610         1020      7         9
21611         1600      8        10
21612         1020      7         9

[21613 rows x 3 columns]

In [ ]:
17. How to check the duplicate values on id,grade and location?
a. house.duplicated(subset=['id','zipcode','grade'])
b. house.duplicate(subset=['id','zipcode','grade'])
c. house.duplicated({'id','zipcode','grade'})
d. All of the above

#Ans: a. house.duplicated(subset=['id','zipcode','grade'])

In [ ]:
house.duplicated(subset=['id','zipcode','grade'])

In [ ]:
18. Which of the following code will help to display the 3rd, 4th and 5th rows from the 6th to 9th
columns of a data frame data?
a. data.loc[3:6, 6:10]
b. data.iloc[3;6,6;10]
c. data.iloc[3:6,6:10]
d. None of the above

#Ans: c. data.iloc[3:6,6:10]

In [ ]:
house.iloc[3:6,6:10]

In [ ]:
19. Which of the following syntax will display the last two records of house?
import pandas as pd
house = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])
a. house.iloc[:'r3']
b. house.loc['r2':'r3']
c. house.iloc['r2':'r3']
d. house.loc[:'r3']

#Ans: b. house.loc['r2':'r3']

In [ ]:
import pandas as pd
house = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])
print(house)
house.loc['r2':'r3']

In [ ]:
20. Which of the following is/are true about loc in pandas:
a. Add new rows in the data frames
b. To change the values of a row to a particular value
c. To extract values from the particular rows
d. All of the above

#Ans: d. All of the above

In [ ]:
21. Change the date column in the format (dd/mm/year) using the pandas to_datetime()
function.

In [ ]:
house['date'] = pd.to_datetime(house['date']).dt.strftime('%d-%m-%Y')
house

In [ ]:
pd.to_datetime(data['date'], format='%Y-%m-%d', utc=False, dayfirst=True)

In [ ]:
22. Create a separate data frame that satisfies the conditions below.
1. Houses built before 1980
2. Have more than 2 bedrooms
3. Have more than 2 floors.

In [ ]:
h_2bf80=house.loc[(house['yr_built']<1980) & (house['bedrooms']>2) & (house['floors']>2)]
h_2bf80

In [ ]:
23. For a given nested list, convert the same into a dataframe.
sample_list = [['Carl', 22],
['Martha', 25],
['Calvin', 12],
['Stuart', 15]
]
The resulting dataframe must contain the column names as ‘Name’, and ‘Age’ with the
respective values from the sample_list.
Expected Output:

In [ ]:
info=[['Carl', 22],
['Martha', 25],
['Calvin', 12],
['Stuart', 15]
]
info
n_lst_df = pd.DataFrame(info, columns=['Name', 'Age'])
n_lst_df

In [ ]:
24. For a given dictionary, convert the same into a dataframe.
sample_dict = {'Cristiano': ['Ronaldo','Man U', 801],
'Lionel': ['Messi','PSG', 758],
'Luis': ['Suarez','Atletico Madrid', 509],
'Robert': ['Lewandowski','Bayern Munich', 527],
'Zlatan': ['Ibrahimovic','AC Milan',553]
}
Expected Output:

In [2]:
import pandas as pd
dic={'Cristiano': ['Ronaldo','Man U', 801],
'Lionel': ['Messi','PSG', 758],
'Luis': ['Suarez','Atletico Madrid', 509],
'Robert': ['Lewandowski','Bayern Munich', 527],
'Zlatan': ['Ibrahimovic','AC Milan',553]
}
dic
dic_df=pd.DataFrame([dic])
dic_df

,Cristiano,Lionel,Luis,Robert,Zlatan
0,"[Ronaldo, Man U, 801]","[Messi, PSG, 758]","[Suarez, Atletico Madrid, 509]","[Lewandowski, Bayern Munich, 527]","[Ibrahimovic, AC Milan, 553]"

In [10]:
df1 = pd.DataFrame(dic) 
df1 = df1.transpose() 
df1.reset_index(inplace = True) 
df1.columns = ['First Name','Last Name', 'Club', 'Goals']

In [11]:
df1

  First Name    Last Name             Club Goals
0  Cristiano      Ronaldo            Man U   801
1     Lionel        Messi              PSG   758
2       Luis       Suarez  Atletico Madrid   509
3     Robert  Lewandowski    Bayern Munich   527
4     Zlatan  Ibrahimovic         AC Milan   553

In [ ]:
25. For a given tuple, convert the same into a dataframe.
sample_tuple = ([1, 'one', 3],
[2, 'two', 3],
[3, 'Three', 5],
[4, 'Four', 4],
[5, 'Five', 4])
Expected output:

In [ ]:
tup=([1, 'one', 3],
        [2, 'two', 3],
        [3, 'Three', 5],
        [4, 'Four', 4],
        [5, 'Five', 4])
tup
tup_df=pd.DataFrame(list(tup), columns=['A','B','C'], index=[0,1,2,3,4])
tup_df

In [ ]:
pd.DataFrame(sample_tuple, columns=['Number', 'Number_text', 'txtlen'])

In [ ]:
26. Create a separate dataframe that contains houses ordered in ascending or descending
order of the prices of each house.

In [ ]:
descprice_house=house.sort_values(by=["price"], ascending = False,inplace=False)
descprice_house

In [ ]:
ascprice_house=house.sort_values(by=["price"],inplace=False)
ascprice_house

In [ ]:
ascending = housing.sort_values('price', ascending=False) descending = housing.sort_values('price', ascending=False)

In [ ]:
27. Calculate the mean and standard deviation of all the numerical values in the dataset. For
example - the mean for the bedrooms column is 3.370 and the standard deviation is 0.930.

In [ ]:
num_house=house.drop(['id'],axis=1,inplace=False)
num_house.describe()

In [ ]:
28. Perform the following operations on the pandas dataframe.
1. Get the data starting from the rows 25 to 35.
2. Get the price of the houses located at the longitude--122.045 latitude- 47.6168.

In [ ]:
#1. Get the data starting from the rows 25 to 35
house.iloc[25:36,:]

In [ ]:
#2. Get the price of the houses located at the longitude--122.045 latitude- 47.6168.
#house.loc[house['id']=='9126100861',['waterfront']]
houz=house.loc[(house['long']==-122.045) & (house['lat']==47.6168)].head()
houz.iloc[:,2]

In [ ]:
data[25:35], data.loc[(housing["lat"] == 47.6168) | (data["long"] == -122.045)]

In [ ]:
29. Create a new dataframe after dropping all the columns except, date, price, and floor
area(sqft_living, sqft_lot, sqft_above, sqft_basement, all combined in one column).
Expected output:

In [ ]:
filt_house['floorarea'] = filt_house[filt_house.columns[2:6]].apply(
    lambda x: ','.join(x.astype(str)),axis=1)
filt_house=filt_house.drop(['sqft_living','sqft_lot','sqft_above','sqft_basement'],axis=1,inplace=False)
filt_house

In [ ]:
data['Floor Area'] = data['sqft_living', 'sqft_lot','sqft_basement','sqft_above']

In [ ]:
30. Perform the following operations on the dataframes given below.
A = pd.DataFrame([['Carl', 22],['Martha', 25],['Calvin', 12],['Stuart', 15]], columns=[‘Name’, ‘Age’])
B = pd.DataFrame([['Melvin', 25],['Martha', 34],['Lewis', 32],['Leo', 25]], columns=[‘Name’, ‘Age’])
1. Left Outer Join
2. Outer Join
3. Inner Join
4. Right Outer Join

In [ ]:
A = pd.DataFrame([['Carl', 22],['Martha', 25],['Calvin', 12],['Stuart', 15]], columns=['Name', 'Age'])
B = pd.DataFrame([['Melvin', 25],['Martha', 34],['Lewis', 32],['Leo', 25]], columns=['Name', 'Age'])
A.merge(B, on='Name', how='left')

In [ ]:
A.merge(B, on='Name', how='right')

In [ ]:
A.merge(B, on='Name', how='inner')

In [ ]:
A.merge(B, on='Name', how='outer')

In [ ]:
inner = pd.merge(A, B, on='Age', how='inner') outer = pd.merge(A, B, on='Age', how='outer') left_outer = pd.merge(A, B, on='Age', how='left') right_outer = pd.merge(A, B, on='Age', how='right')

In [ ]:
31. What will be the correlation between the columns sqft_living and sqft_above?
1. 0.702035
2. 0.754665
3. 0.876597
4. 0.303093

#Ans: 3. 0.876597

In [ ]:
print(house['sqft_living'].corr(house['sqft_above']))

In [ ]:
32. If the correlation between the columns bathrooms and sqft_living is 0.754665, what all
interpretations can be made about the two columns?
1. A positive correlation between the two columns
2. The columns show perfect correlation.
3. A strong negative correlation between the two columns
4. No correlation between the two columns.

#Ans: 1. A positive correlation between the two columns

In [ ]:
print(house['sqft_living'].corr(house['bathrooms']))